namespace game;

/// <summary>
/// Перечисление, представляющее уровни сложности игры.
/// </summary>
public enum DifficultyLevel
{
    /// <summary>
    /// Легкий уровень сложности, предназначенный для начинающих игроков.
    /// Игра будет иметь более простые задачи и меньшую сложность.
    /// </summary>
    Easy,

    /// <summary>
    /// Средний уровень сложности, подходящий для игроков с некоторым опытом.
    /// Игра будет включать более сложные задачи и умеренные вызовы.
    /// </summary>
    Medium,

    /// <summary>
    /// Сложный уровень сложности, предназначенный для опытных игроков.
    /// Игра будет содержать самые трудные задачи и максимальные вызовы.
    /// </summary>
    Hard
}
